app/views/plantlibraries/show.html.erb

SELECT "plants".* FROM "plants" WHERE "plants"."plantlibrary_id" = ?  [[nil, 1]]
---
  <tbody>
    <% @plantlibrary.plants.each do |plant| %>