app/controllers/plants_controller.rb

INSERT INTO "plants" ("plantlibrary_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["plantlibrary_id", 1], ["created_at", "2017-05-14 20:13:36.386303"], ["updated_at", "2017-05-14 20:13:36.386303"]]
---
  def create
  	if current_user != nil
	  	@plant = Plant.new(plant_params)
	  	@plant.plantlibrary = current_user.plantlibrary

	    respond_to do |format|
	      if @plant.save