app/controllers/plantlibraries_controller.rb

  def index
  	@plantlibraries = Plantlibrary.all
---
SELECT "plantlibraries".* FROM "plantlibraries"

  def show
  	@plantlibrary = Plantlibrary.find(params[:id])
---
SELECT  "plantlibraries".* FROM "plantlibraries" WHERE "plantlibraries"."id" = ? LIMIT 1  [["id", 1]]