app/controllers/plantclubs_controller.rb

  def index
    @plantclubs = Plantclub.all
---
SELECT "plantclubs".* FROM "plantclubs"

    def set_plantclub
      @plantclub = Plantclub.find(params[:id])
---
SELECT  "plantclubs".* FROM "plantclubs" WHERE "plantclubs"."id" = ? LIMIT 1  [["id", 1]]