app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @plantlibrary = Plantlibrary.new(name: "My plantlibrary", user: @user)
    @user.plantlibrary = @plantlibrary

    respond_to do |format|
      if @user.save
---
INSERT INTO "plantlibraries" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "My plantlibrary"], ["user_id", 5], ["created_at", "2017-04-27 19:56:49.361309"], ["updated_at", "2017-04-27 19:56:49.361309"]]
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Anni"], ["password", "anni23"], ["created_at", "2017-04-14 23:04:55.011169"], ["updated_at", "2017-04-14 23:04:55.011169"]]